<?php
  session_start();
  if (!$_SESSION["AUTH"]) {
    include_once("forwarding.js");
    die;
  }
?>
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <title></title>
  </head>
  <body>
    <?php
      require_once("config.php");

      $link = mysql_connect($host, $user, $password) or die("Не удалось подключится
      к MySQL".mysql_error());
      mysql_select_db($db, $link) or die("Не удлаось подключится к БД".mysql_error());

      $idArr = array(
        650, 623, 676, 612, 610, 609, 608, 605, 594, 593, 591, 592, 590, 589, 588,
        587, 586, 585, 581, 576, 573, 572, 571, 568, 624, 545, 544, 543, 542, 541,
        540, 538, 535, 536, 537, 532, 531, 530, 529, 528, 527, 526, 525, 524, 523,
        522, 520, 519, 518, 517, 516, 513, 510, 502, 501, 500, 499, 492, 457, 253,
        456, 444, 438, 248, 408, 406, 389, 388, 220, 380, 378, 217, 382, 366, 365,
        363, 201, 340, 327, 325, 311, 303, 299, 265, 275, 260, 232, 1297, 209, 246,
        203, 242, 141, 231, 163, 111, 228
      );

      foreach ($idArr as $key) {
        $delSku = mysql_query("UPDATE `host6597_1`.`oc_product` SET `sku` = '' WHERE `oc_product`.`product_id` = '$key';", $link);
        if ($delSku) {
          echo "Запрос выполнен успешно. id. " . $key;
        } else {
          die("Ошибка в запросе! Текст ошибки: ".mysql_error());
        }
        echo "<br>";
      }

      $skuArr = array(14,22,61,62,63,64,65,66,67,68,156,187,188,189,190,198,204,209,212,231,
      234,241,242,243,246,260,262,263,264,304,329,332,333,340,342,346,347,348,356,357,
      358,359,367,382,384,386,415,429,438,454,458,478,485,486,487,488,489,497,498,499,
      500,501,517,519,528,532,534,547,552,561,564,565,566,567,570,571,586,587,594,600,
      601,621,622,624,630,633,635,639,640,641,642,653,658,662,663,664,665,666,667,668,
      669,670,671,675,681,693,694,700,711,712,720,721,722,724,764,770,802,803,804,805,
      806,807,808,809,810,811,812,813,814,815,816,817,818,844,845,855,856,859,869,870,
      871,872,934,964,965,966,967,973,977,978,994,1002);
      foreach ($skuArr as $key) {
        $delSku = mysql_query("UPDATE `host6597_1`.`oc_product` SET `sku` = '' WHERE `oc_product`.`sku` = '$key';", $link);
        if ($delSku) {
          echo "Запрос выполнен успешно. Арт. " . $key;
        } else {
          die("Ошибка в запросе! Текст ошибки: ".mysql_error());
        }
        echo "<br>";
      }
      mysql_close($link);
    ?>
  </body>
</html>
